In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df = pd.read_csv("/Users/ranadheerkarasani/Downloads/segmentation data.csv")

In [4]:
df.head()

,ID,Sex,Marital status,Age,Education,Income,Occupation,Settlement size
0,100000001,0,0,67,2,124670,1,2
1,100000002,1,1,22,1,150773,1,2
2,100000003,0,0,49,1,89210,0,0
3,100000004,0,0,45,1,171565,1,1
4,100000005,0,0,53,1,149031,1,1

In [5]:
df.isnull().sum()

ID                 0
Sex                0
Marital status     0
Age                0
Education          0
Income             0
Occupation         0
Settlement size    0
dtype: int64

In [6]:
df.head()

,ID,Sex,Marital status,Age,Education,Income,Occupation,Settlement size
0,100000001,0,0,67,2,124670,1,2
1,100000002,1,1,22,1,150773,1,2
2,100000003,0,0,49,1,89210,0,0
3,100000004,0,0,45,1,171565,1,1
4,100000005,0,0,53,1,149031,1,1

In [9]:
df['ID'].nunique()

2000

In [11]:
df.shape

(2000, 8)

In [18]:
df= df.drop('ID', axis = 1)

In [19]:
df

      Sex  Marital status  Age  Education  Income  Occupation  Settlement size
0       0               0   67          2  124670           1                2
1       1               1   22          1  150773           1                2
2       0               0   49          1   89210           0                0
3       0               0   45          1  171565           1                1
4       0               0   53          1  149031           1                1
...   ...             ...  ...        ...     ...         ...              ...
1995    1               0   47          1  123525           0                0
1996    1               1   27          1  117744           1                0
1997    0               0   31          0   86400           0                0
1998    1               1   24          1   97968           0                0
1999    0               0   25          0   68416           0                0

[2000 rows x 7 columns]

In [21]:
df['Sex'].value_counts()

Sex
0    1086
1     914
Name: count, dtype: int64

In [22]:
df['Settlement size'].value_counts()

Settlement size
0    989
1    544
2    467
Name: count, dtype: int64

In [23]:
def countOfEachValue(data, column_names):
    for column in column_names:
        print(data[column].value_counts())

In [24]:
countOfEachValue(df, ['Sex', 'Marital status','Education', 'Occupation', 'Settlement size' ])

Sex
0    1086
1     914
Name: count, dtype: int64
Marital status
0    1007
1     993
Name: count, dtype: int64
Education
1    1386
2     291
0     287
3      36
Name: count, dtype: int64
Occupation
1    1113
0     633
2     254
Name: count, dtype: int64
Settlement size
0    989
1    544
2    467
Name: count, dtype: int64